#define _CRT_SECURE_NO_WARNINGS 1 
#include<stdio.h>
//百度面试题
//思路：观察第一个字节内容是什么
//int check_sys()
//{
//	int a = 1;
//	//二进制：0000 0000 0000 0000 0000 0000 0000 0001
//	//0x00000001
//	char* p = (char*)&a;//char*指针解引用为一个字节
//	if (*p == 1)
//		return 1;
//	else
//		return 0;
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret = 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//}
//int main()
//{
//	char a = -1;
//	//1000 0000 0000 0000 0000 0000 0000 0001
//	//1111 1111 1111 1111 1111 1111 1111 1110
//	//1111 1111 1111 1111 1111 1111 1111 1111
//
//	//1111 1111
//	//整形提升
//	//1111 1111 1111 1111 1111 1111 1111 1111
//	//1000 0000 0000 0000 0000 0000 0000 0000
//	//1000 0000 0000 0000 0000 0000 0000 0000 - -1
//	signed char b = -1;
//	//求解过程和a相同
//	unsigned char c = -1;
//	
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1,-1,255
//	//当打印a,b,c时，要整形提升
//	return 0;
//}
//255是怎么来的？
//1111 1111
//unsigned - 无符号数 - 高位直接补0
//0000 0000 0000 0000 0000 0000 1111 1111
//正数原反补相同 - 255
