#define _CRT_SECURE_NO_WARNINGS 1 
#include<stdio.h>
//int main()
//{
//	int arr[3][4] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//	}
//	return 0;
//}
//二维数组在内存中是连续存放的
//可以把它当成一个一维数组看待，是由12个整形组成的一维数组
//也可以看做由三个一维数组组成的二维数组
//第一行一维数组访问元素为arr[0][j]，把arr[0]看做数组名，j看做元素下标
//int main()
//{
//	int arr[10];//不初始化被初始化为随机值
//	//部分初始化，其他元素被默认初始化为0
//}

//数组越界访问
//二维数组列越界
//int main()
//{
//	int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}
//数组在传参时，传参只能传数组名，传进去的是数组，
//但实际上传的是首元素的地址，可以把他叫做数组的降级
//所以数组形参不会创建一个数组来接受，实际上是指针，
//写成数组的形式，元素个数也可以省略掉
//写成数组和指针的方式都可以

//为什么数组传参只传首元素地址？
//避免时间和空间的浪费，数组内容多不仅浪费时间，并且浪费空间
int main()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p = &arr[0];
	int i = 0;
	for (i = 0; i < 10; i++)
	{
		printf("%p = %p\n", p + i, &arr[i]);
	}
	return 0;
}