#define _CRT_SECURE_NO_WARNINGS 1 
#include<stdio.h>
//int main()
//{
//	//1E10
//	//代表：1.0 * (10 ^ 10)
//	//float.h 定义了浮点数的取值范围的相关信息
//	//limits.h 定义了整形数的取值范围的相关信息
//
//	int n = 9;
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);//1091567616
//	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
//	return 0;
//}

//5.5
//101.1
//(1*2^2 + 0*2^1 + 0*2^0).(1*2^(-1))
//101.1 ->1.011
//(-1)^0*1.011*2^2
//  +      M    E
// 
//
//(-1) ^ S* M * 2 ^ E
//(-1) ^ S表示符号位，当S = 0，V为正数；当S = 1，V为负数。
//M表示有效数字，大于等于1，小于2。
//2 ^ E表示指数位。

//101.1转化为1.011

//对于32位
//s:1	 e:8		m:23
//64
//s:1	 e:11		m:52