#define _CRT_SECURE_NO_WARNINGS 1 
#include<stdio.h>
//int main()
//{
//	//1E10
//	//代表：1.0 * (10 ^ 10)
//	//float.h 定义了浮点数的取值范围的相关信息
//	//limits.h 定义了整形数的取值范围的相关信息
//
//	int n = 9;
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);//1091567616
//	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
//	return 0;
//}

//5.5
//101.1
//(1*2^2 + 0*2^1 + 0*2^0).(1*2^(-1))
//101.1 ->1.011
//(-1)^0*1.011*2^2
//  +      M    E
// 
//
//(-1) ^ S* M * 2 ^ E
//(-1) ^ S表示符号位，当S = 0，V为正数；当S = 1，V为负数。
//M表示有效数字，大于等于1，小于2。
//2 ^ E表示指数位。

//101.1转化为1.011

//对于32位(单位：比特位)
//s:1	 e:8		m:23
//64
//s:1	 e:11		m:52

//m只存小数点后面的位，1并不会存入
//e被认为是无符号数但是实际上是会出现负数的
//例如0.5
//表示成二进制形式为：0.1
//(-1) ^ 0 * 1.0 * 2 ^ (-1)
//这时e为-1，所以做出修正，单精度浮点数，在存放e时需加上127存入
//双精度浮点数，在存放时需要加1023存进去


//int main()
//{
//	float f = 5.5;
//	//101.1
//	//(-1)^0*1.011*2^2
//	//S = 0
//	//E = 2	+ 127 = 129//无符号整数，无符号位
//	//M = 1.011
//	//存储到内存
//	//0100 0000 1011 0000 0000 0000 0000 0000//32为
//	//4 0 b 0 0 0 0 0
//	return 0;
//}

//int main()
//{
//	float f = 0.5;
//	return 0;
//}
//0.1
//(-1)^0*(1.0)*2^(-1)
//S = 0
//E = -1 + 127 = 126
//M = 1.0
//0011 1111 0000 0000 0000 0000 0000 0000
//3 f 0 0 0 0 0 0 

//现在解答开篇的问题
//int main()
//{
//	int n = 9;
//	//0000 0000 0000 0000 0000 0000 0000 1001
//	float* pFloat = (float*)&n;
//	//0 00000000 00000000000000000001001
//	//e为全零 E = 1 - 127 = -126
//	//M = 0.00000000000000000001001
//	//S = 0
//	//-1^0*0.00000000000000000001001*2^(-126)
//	//几乎为0
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
//	*pFloat = 9.0;
//	//1001.0
//	//1.001 * 2 ^ 3
//	//(-1)^0 * 1.001 * 2 ^ 3
//	//S = 0
//	//M = 1.001
//	//E = 3
//	//0 01000010 00100000000000000000000
//	printf("num的值为：%d\n", n);//1091567616
//	//认为内存中放的是有符号整数
//	//二进制序列就是它的原码
//	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
//	return 0;
//}